# IsNameUnique Method (Document, String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadBuildingType..::..IsNameUnique Method (Document, String)
HVACLoadBuildingType Class See Also
---
Determines whether a potential building type name is unique.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool IsNameUnique(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function IsNameUnique ( _
	document As Document, _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNameUnique(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
name
    Type: System..::..String The candidate name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
HVACLoadBuildingType Class
IsNameUnique Overload
Autodesk.Revit.DB.Analysis Namespace